define('Controls-demo/List/Tree/GridData', function() {
   var
      data = {
         catalog: [
            {
               'id': '2246',
               'Раздел': null,
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '01. Лицензии СБИС (активируются на reg)',
               'p0': null
            },
            {
               'id': '454339',
               'Раздел': null,
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '02. Лицензии СБИС (оформление на inside)',
               'p0': null
            },
            {
               'id': '2253',
               'Раздел': null,
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '03. Носители ЭП',
               'p0': null
            },
            {
               'id': '457275',
               'Раздел': null,
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '04. Удостоверяющий центр',
               'p0': null
            },
            {
               'id': '452815',
               'Раздел': null,
               'Группа': 'group_2',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '05. Торговое оборудование',
               'p0': null
            },
            {
               'id': '457244',
               'Раздел': null,
               'Группа': 'group_2',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '06. Услуги',
               'p0': null
            },
            {
               'id': '454687',
               'Раздел': null,
               'Группа': 'group_2',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '07. СБиС бухгалтерия и аудит',
               'p0': null
            },
            {
               'id': '3988',
               'Раздел': null,
               'Группа': 'group_2',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '08. ПО других компаний',
               'p0': null
            },
            {
               'id': '440833',
               'Раздел': null,
               'Группа': 'group_3',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '09. Материалы и инвентарь',
               'p0': null
            },
            {
               'id': '439374',
               'Раздел': null,
               'Группа': 'group_3',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '10. Presto',
               'p0': null
            },
            {
               'id': '455558',
               'Раздел': null,
               'Группа': 'group_3',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '11. Служебное (результат синхронизации)',
               'p0': null
            },
            {
               'id': '458962',
               'Раздел': null,
               'Группа': 'group_4',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'НОВЫЕ ТОВАРЫ',
               'p0': null
            },
            {
               'id': '471641',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Presto',
               'p0': null
            },
            {
               'id': '453094',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Архив',
               'p0': null
            },
            {
               'id': '453062',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Все о компаниях и Торги',
               'p0': null
            },
            {
               'id': '465756',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Дополнительное место хранения',
               'p0': null
            },
            {
               'id': '466943',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Дополнительные sms',
               'p0': null
            },
            {
               'id': '453063',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Дополнительные пользователи',
               'p0': null
            },
            {
               'id': '461394',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'ОФД',
               'p0': null
            },
            {
               'id': '466938',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Пакеты расширений',
               'p0': null
            },
            {
               'id': '453064',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Точка продаж (ЕГАИС и Розница)',
               'p0': null
            },
            {
               'id': '452955',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'ЭДО',
               'p0': null
            },
            {
               'id': '452922',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Электронная отчетность',
               'p0': null
            },
            {
               'id': '452954',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': 'Электронные подписи',
               'p0': null
            },
            {
               'id': '439491',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования аккаунта sbis.ru в течение 1 года',
               'p0': 500
            },
            {
               'id': '452639',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования \'СБИС SAPPER\' (без настроек)',
               'p0': 150000
            },
            {
               'id': '468884',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования \'СБИС Корпоративный УЦ\'',
               'p0': 30000
            },
            {
               'id': '445056',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования \'СБИС Нулевка\' по 1 компании',
               'p0': 500
            },
            {
               'id': '445199',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования СБИС Предприятие',
               'p0': null
            },
            {
               'id': '92',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования \'СБИС Расширенный аналитический блок\'',
               'p0': 3000
            },
            {
               'id': '4117',
               'Раздел': '2246',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования \'СБиС++ ЭО: Расширенный аналитический блок\'',
               'p0': 2000
            },
            {
               'id': '3139',
               'Раздел': '454339',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования возможности \'СБиС++\' для отправки медицинской отчетности в течение 1 года',
               'p0': 4900
            },
            {
               'id': '464182',
               'Раздел': '454339',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования \'СБИС SAPPER\' (с базовыми документами)',
               'p0': 250000
            },
            {
               'id': '445507',
               'Раздел': '454339',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования СБИС Витрина для внешнего документооборота',
               'p0': 1
            },
            {
               'id': '461101',
               'Раздел': '454339',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования СБИС по регистрации одного сотрудника в ЕГАИС с правом использования электронной подписи в течение двух лет',
               'p0': 2000
            },
            {
               'id': '461104',
               'Раздел': '454339',
               'Группа': 'group_1',
               'Раздел@': null,
               'Раздел$': null,
               'Наименование': 'Права использования СБИС по регистрации одного сотрудника в ЕГАИС с правом использования электронной подписи в течение трёх лет',
               'p0': 3000
            }
         ]
      };
   return data;
});
