define('Controls-demo/List/Tree/TreeWithEditingData', function() {
   var
      data = {
         catalog: [
            {
               'id': 2246,
               'Раздел': null,
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '01. Лицензии СБИС',
               'Описание': 'Арахисовые лепестки'
            },
            {
               'id': 454339,
               'Раздел': null,
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '02. Лицензии СБИС (оформление на inside)',
               'Описание': 'Вафельная крошка'
            },
            {
               'id': 2253,
               'Раздел': null,
               'Раздел@': true,
               'Раздел$': null,
               'Наименование': '03. Носители ЭП',
               'Описание': 'Глазурь Премиум'
            }
         ]
      };
   return data;
});
