define('Controls-demo/List/Tree/MassSelection/MassSelectionData', function() {
   var
      data = {
         catalog: [
            {
               'id': 1,
               'Раздел': null,
               'Раздел@': true,
               'Наименование': 1
            }, {
               'id': 2,
               'Раздел': 1,
               'Раздел@': true,
               'Наименование': 2
            }, {
               'id': 3,
               'Раздел': 2,
               'Раздел@': false,
               'Наименование': 3
            }, {
               'id': 4,
               'Раздел': 2,
               'Раздел@': false,
               'Наименование': 4
            }, {
               'id': 5,
               'Раздел': 1,
               'Раздел@': false,
               'Наименование': 5
            }, {
               'id': 6,
               'Раздел': null,
               'Раздел@': true,
               'Наименование': 6
            }, {
               'id': 7,
               'Раздел': null,
               'Раздел@': false,
               'Наименование': 7
            }
         ]
      };
   return data;
});
