define('Controls-demo/List/Tree/MassSelection/MassSelectionData', function() {
   var
      data = {
         catalog: [
            {
               'id': 2246,
               'Раздел': null,
               'Раздел@': true,
               'Наименование': '01. Лицензии СБИС (активируются на reg)',
               'multiSelectionProperty': null
            },
            {
               'id': 454339,
               'Раздел': null,
               'Раздел@': true,
               'Наименование': '02. Лицензии СБИС (оформление на inside)',
               'multiSelectionProperty': true
            },
            {
               'id': 471641,
               'Раздел': 2246,
               'Раздел@': true,
               'Наименование': 'Presto'
            },
            {
               'id': 471643,
               'Раздел': 471641,
               'Раздел@': null,
               'Наименование': 'Один'
            },
            {
               'id': 453094,
               'Раздел': 2246,
               'Раздел@': true,
               'Наименование': 'Архив'
            },
            {
               'id': 439491,
               'Раздел': 2246,
               'Раздел@': null,
               'Наименование': 'Права использования аккаунта sbis.ru в течение 1 года'
            },
            {
               'id': 452639,
               'Раздел': 2246,
               'Раздел@': null,
               'Наименование': 'Права использования \'СБИС SAPPER\' (без настроек)'
            },
            {
               'id': 468884,
               'Раздел': 2246,
               'Раздел@': null,
               'Наименование': 'Права использования \'СБИС Корпоративный УЦ\''
            },
            {
               'id': 445056,
               'Раздел': 2246,
               'Раздел@': null,
               'Наименование': 'Права использования \'СБИС Нулевка\' по 1 компании'
            },
            {
               'id': 3139,
               'Раздел': 454339,
               'Раздел@': null,
               'Наименование': 'Права использования возможности \'СБиС++\' для отправки медицинской отчетности в течение 1 года'
            },
            {
               'id': 464182,
               'Раздел': 454339,
               'Раздел@': null,
               'Наименование': 'Права использования \'СБИС SAPPER\' (с базовыми документами)'
            },
            {
               'id': 445507,
               'Раздел': 454339,
               'Раздел@': null,
               'Наименование': 'Права использования СБИС Витрина для внешнего документооборота'
            },
            {
               'id': 461101,
               'Раздел': 454339,
               'Раздел@': null,
               'Наименование': 'Права использования СБИС по регистрации одного сотрудника в ЕГАИС с правом использования электронной подписи в течение двух лет'
            },
            {
               'id': 461104,
               'Раздел': 454339,
               'Раздел@': null,
               'Наименование': 'Права использования СБИС по регистрации одного сотрудника в ЕГАИС с правом использования электронной подписи в течение трёх лет'
            }
         ]
      };
   return data;
});
